---
kind: property
id: P:Autodesk.Revit.Attributes.TransactionAttribute.Mode
source: html/1c7b2027-914a-b7e2-dd45-68573902b2e0.htm
---
# Autodesk.Revit.Attributes.TransactionAttribute.Mode Property

Transaction mode.

## Syntax (C#)
```csharp
public TransactionMode Mode { get; }
```